#!/usr/bin/env python
# -*- coding: utf-8 -*-
# @Time    : 2017/11/27 下午2:11
# @Author  : Hou Rong
# @Site    : 
# @File    : get_baidu_cid.py
# @Software: PyCharm
import pandas


def mk_n_2_id():
    _n2id = {}
    table = pandas.read_csv("/Users/hourong/Downloads/area_id_name")
    for i in range(len(table)):
        line = dict(table.iloc[i])
        _n2id[line['name']] = line['area_id']
    return _n2id


if __name__ == '__main__':
    n2id = mk_n_2_id()
    for c_name in ['克拉玛依市', '长治市', '永州市', '绥化市', '巴音郭楞蒙古自治州', '拉萨市', '云浮市', '益阳市', '百色市', '资阳市', '荆门市', '松原市',
                   '凉山彝族自治州', '达州市', '伊犁哈萨克自治州', '广安市', '自贡市', '汉中市', '朝阳市', '漯河市', '钦州市', '贵港市', '安顺市', '鄂州市', '广元市',
                   '河池市', '鹰潭市', '乌兰察布市', '铜陵市', '昌吉回族自治州', '衡水市', '黔西南布依族苗族自治州', '濮阳市', '锡林郭勒盟', '巴彦淖尔市', '鸡西市', '贺州市',
                   '防城港市', '兴安盟', '白山市', '三门峡市', '忻州市', '双鸭山市', '楚雄彝族自治州', '新余市', '来宾市', '淮北市', '亳州市', '湘西土家族苗族自治州',
                   '吕梁市', '攀枝花市', '晋城市', '延安市', '毕节市', '张家界市', '酒泉市', '崇左市', '萍乡市', '乌海市', '伊春市', '六盘水市', '随州市',
                   '德宏傣族景颇族自治州', '池州市', '黑河市', '哈密市', '文山壮族苗族自治州', '阿坝藏族羌族自治州', '天水市', '辽源市', '张掖市', '铜仁市', '鹤壁市',
                   '儋州市', '保山市', '安康市', '白城市', '巴中市', '普洱市', '鹤岗市', '莱芜市', '阳泉市', '甘孜藏族自治州', '嘉峪关市', '白银市', '临沧市',
                   '商洛市', '阿克苏地区', '海西蒙古族藏族自治州', '大兴安岭地区', '七台河市', '朔州市', '铜川市', '定西市', '迪庆藏族自治州', '日喀则市', '庆阳市', '昭通市',
                   '喀什地区', '怒江傈僳族自治州', '海东市', '阿勒泰地区', '平凉市', '石嘴山市', '武威市', '阿拉善盟', '塔城地区', '林芝市', '金昌市', '吴忠市', '中卫市',
                   '陇南市', '山南市', '吐鲁番市', '博尔塔拉蒙古自治州', '临夏回族自治州', '固原市', '甘南藏族自治州', '昌都市', '阿里地区', '海南藏族自治州', '和田地区',
                   '克孜勒苏柯尔克孜自治州', '海北藏族自治州', '那曲地区', '玉树藏族自治州', '黄南藏族自治州', '果洛藏族自治州', '三沙市']:

        try:
            if c_name not in n2id and c_name.endswith('市'):
                c_name = c_name.replace('市', '地区')
            print("({}, '{}'),".format(n2id[c_name], c_name))
        except Exception:
            print(c_name)
